  [
    {
      "file": "experiments/example.js",
      "name": "Example experiment",
      "description": "This is the given example."
    },

    {
      "file": "experiments/example2.js",
      "name": "Example2",
      "description": "This variation includes a random color and a random diameter between 20 and 100."
    },

    {
      "file": "experiments/example3.js",
      "name": "Example3",
      "description": "This example have four circles with certain colors but it makes the diameter grow and then decrese between 10 and 70."
    },

    {
      "file": "experiments/example4.js",
      "name": "Example4",
      "description": "This example have four circles with random colors but it makes the diameter grow and then decrese between 10 and 70. It also gives a random rotation direction to the elipses. It checks with an if statement if a random number is larger or smaller than 0.5, which is 50%/ 50% chance, and gives it a value of 1 or -1. Then when drawing the elipse, in the rotation I multiply this number by 'frameCount' and that is how I get the direction."
    },


      {
        "file": "experiments/molnar.js",
        "name": "Molnar recreation",
        "description": "This is a recreation of the molar example but I made it that the shape is smaller as the 'i' increases; the variance is also calculated based on the half of the size of each shape."
      }, 
      
      {
        "file": "experiments/molnar2.js",
        "name": "Molnar3",
        "description": "In this variation I used random for the colors of each layer of the shape."
      }, 

      {
        "file": "experiments/molnar3.js",
        "name": "Molnar2",
        "description": "This variation gives a purple color to the shapes and encludes a loop that creates an animation."
      }, 

      {
        "file": "experiments/molnar4.js",
        "name": "Molnar4",
        "description": "This variation checks if a row in the grid is an even or an odd number and gives different values to the shapes depending on that."
      }, 

      {
        "file": "experiments/noise.js",
        "name": "Noise recreation",
        "description": "This is a recreation of the noise example from the lecture."
      },

      {
        "file": "experiments/noise2.js",
        "name": "Noise2",
        "description": "In this variation the color is set to red and there is a loop that creates an animation."
      },

      {
        "file": "experiments/noise3.js",
        "name": "Noise3",
        "description": "In this variation a random color is included to each dot."
      },

  {
    "file": "experiments/drone-show.js",
    "name": "Drone show",
    "description": "The project will present a sequence of rotating circles to create different forms, simulating a drone light show. The images observed from the ground in drone light shows serve as inspiration. This will be done by using JavaScript and the p5.js package to create dynamic and generative art. To create a changing visual experience, I should play with grid layout, rotation, and animation using the code."
  }
]
